import React from 'react'

const Web3 = () => {
  return (
    <div>
      Web3
      Մինչ անցնելը web3.0 ին եկեք հասկանանք ինչա web1.0 և web2.0:
      Web1.0 հասկացողությունը իհայտ եկավ մենակ են ժամանակ երբ հայտնվեց web2.0։  Այն ինչը տեղի էր »ւնեցել web2.0 ից առաջ անվանվեց web1.0:
      Web1 ժամանակահատվածը ներառում է 1991-2004թվակաները։
      այս ժամանակահատվածում ինտերնետը իրենից ներկայացնում էր ստատիկ կայքեր որոնց կոնտենտը ստեղծվում էր ծրագրավորողների կողմից ովքեր սպասարկում էին այդ կայքերը։ ոչ մի հետադարձ կապ օգտագործողները չէին կարող ունենալ կայքերում։(ոչմի գրանցում լոգինիզացիա կամ կոնտենտի մշակում ) web1.0 անվանում են նաև read-only միայն կարդալու համար։
      Ընդանրացնելով web1 ի գափարը նշենք որ ամենինչը ինչ ստեղծվում էր և մատուցվումեր օգտագործողին պահպանվում էր կենտրոնացված սերվերներում կայքերի ստեղծողների կողմից։
      Web2
      Web2 գախափարը հիմնականում ասոցացվում է Թիմ Օրելիի հրապարակման հետ, what is web2.0
      Հրապարակված 30.09.2005թ ին։
      Հիմնական կարևոր տարբերությունը web2 web1 մեջ դա սոցիալական կայքերի իհայտ գալն էր։ սոցկայքերը թույլ տվեցին կայքերում հրապարակումներ անել ոչ միայն ծրագրավորողներին այլ նաև բոլոր օգտագործողներին։
      Մենք մեր ինֆորմացիայով կիսվում ենք կայքերում իսկ կայքերի տերերը մեր ռետուրսները օգտագործում են իրենց նպատակների համար։

      Web2 կարելի է անվանել նաև գովազդների ինտերնետ և գաղտնիության ապահովության թերիություն:

      Web2 անվանվում է նաև Read-Write
      (Կարդալ, ձայնագրել )

      Web2 թերություները հանգեցրեցին web3 հասկացողության իհայտ գալուն։ դեռ web1 ից սկսած պահպանվում է արխիտեկտուրան Clint server երբ օգտագործողը դիմումա սերվերին և սերվերը վերադարձնում է պատաախանը։ Սերվերները պատկանում են կոնկրետ մարդկանց կամ կամպանյաներին որոնք կարող են արգելափակել ցանկացած բան ինչը նրանց դուրը չգա։ եվս մեկ խնդիր երբ ձեր մասին անձնական տվյալները գտնվում են կոնկրետ կամանյաների ձեռքում։
      Այս թերություները հաշվի Առնելով առաջացավ web3 հասկացողությունը։
      Web3
      Web3 այս պահին դեռ ձևավորման փուլում է գտնվում։
      Որը օգտագործում է Բլոկչեյն տեխնոլոգիան և DAO ի գաղափարը
      Web3 հիմնական գախափարը դա ապակենտրոնացումն է ինչպես նաև web3 դուրս է գալիս ինտերնետի միջակայքից մտնելիվ ռեալ աշխարհ


      Սա փորձ է փոխել ֆինանսական աշխարհը, նոր կանոներ ստեղծել կազմակերպություների համար ստեղծելով նոր աշխարհ։

      1 web3 գոյություն պետքա ունենա ոչ թե կենտրոնացված սերվերներում որոնք պատկանում են կոնկրետ կազմակերպություներին այլ լինելու է սփռված տվյալների բազա որոնք կպահպանվեն նոդ հանգույցներում և ցանակացածը կարող է դառնալ այդ Նոդի մաս։ այսպիսով կլուծվի այն հարցը երբ օրինակ մի կազմակերպ. Ցանկանա ջնջի ինչ որ տվյալ այս դեպքում դա հնարավոր չի լինի քամի որ ջնջվող կոնտենտի կոպիան կլինի հազարավոր համակարգիչների մեջ ։

{/* App => DApp */}


      Web3 N2
      Web3 գաղափարը կար դեռ տասնամյակներ առաջ, բայց նրա նկատմամբ հետաքրքրությունը աճեց վերջին տարիներին կրիպտոարժույթների ՆՖՏ ների և ԴեՖի հայտնիության ֆոնի վրա։  և ապագայում հենց այս տեխնոլոգիաները արդեն կոգտագործվեն այսօրվա ֆինա սական համակարգի փոխարեն։
      Web3.0 սա լիովին նորարաական տեխնոլոգիաների  գախափար է որը կփոխարինի այսօրվա մեր իմացած ինտերնետին որտեղ կոգտագործվեն բլոկչեյն տեխնոլոգիաները և բոլոր լավագույն գործիքները Ապակենտրոնացումի
      Հիմնական web3 ի գործառույթները
      Հիմնականում ուղված են լինելու ներկայիս ֆինանասական սիստեման փոխարինելու մեջ,  մարդկանց հաղորդակցման մեջ, կազմակերպություների աշխատանքի փոփոխումը և լիովին նոր աշխարհ կառուցելու մեջ։

      Web3 հիմնական առավլություները
      1 Ապակենտրոնացում - բոլոր ինֆորմացիաները չեն պահպանվի ինչոր կազմակերպոգթյան կոնկրետ սերվերում այն կլինի սփռված Բազա Դաննի որը կպահպանվի տարբեր համակարգիչների մեջ։ Բլոկչեյն  տեխնոլոգիան թույլ կտա այս ֆորմատով ինֆորմացիան պահելու ինչպես նաև մասնակիցների միջև վստահությխն ձեռք բերմանը
      2 կրիպտոարժույթներ և ՆՖՏ - սրանք կունենան կարևոր դեր նոր ինտերնետի մեջ»  քանի որ հենց սրանք են իրենց վրա վերցնում թվային արժեքների պահպանման. Գործը ապակենտրոնացված Բլոկչեյն ցանցում
      3 Վստահություն և սահմանափակման վերացում -
      Բոլոր ինտերնետից օգտվողները կարող են հաղորդակցվել միմիանց հետ ուղակիորեն առանց ինչ որ երրորդ դեմքի ինչպես նաև առանց ինչոր թույլատրող օրգաների
      4 Բաց կոդեր - web3 ծրագրեէի մեծ մասը կլինի Բաց բոլոր ծրագրավորողների համար Հենց թափանցիկությունը կունենա մեծ դեր կառուցելու թվային նոր աշխարհ
      5 Տոկենացված Կոնտենտ - ողջ ձեր կոնտենտը որը կներբեռնեք ինտերնետ կարող է տոկենացվել և ներկայացվել որպես ՆՖՏ այսինքն ցանկացած ձեր ստեղծած կոնտենտ կլինի ունիկալ և կհաստատի որ դուք եք նրա սեփականատերը
      6 դոստուպ ցանկացած վայրից - web3 թույլ կտա մուտք գործ ել ինտերնետ ցանկացած վայրից ցանկացած գաջեթից
      7 Գրանցաման մեկ ձև -
      Որը կմիանա ձեր ինտերնետի բոլոր ռեսուրսներին։ այսպես ասած ձեր ստեղծած ակաունտը կարող է օգտագործվել  ոչ միայն մուտք գոէծելու որև է սոց կայք այլ նաև օգտագործվի դրամապանակին հասանելիություն ստանալու համար և այլն բայց այս ամենը կլինի անանուն դուք կոգտվեք ինտերնետի բոլոր ծառայություներից բայց ոչ ոք չի կարող հետև էլ ձեր տվյալներին
      8 DAO - բոլոր կազմ ղրագրերը կլինեն ԴԱՕ սրանք այնպիսի կազմակերպություներ են որտեղ չկան ղեկավարներ տնօրեներ կամ սեփականատերեր Գլխավոր դերը այստեղ օգտագործողներին է որոնք ունեն ձայնի իրաունք
    </div>
  )
}

export default Web3