import React from 'react'

const Tocenomics = () => {
  return (
    <div>
      <h1>Տոկենոմիկա</h1>
      <b>
        Ինչ է տոկենոմիկան և ինչու է այն կարևոր: Տոկենոմիկան
        առաջցել է Տոկեն և Էկոնոմիկա բառերի միասնությունից։
        Նախ մինչ որև է
        կրիպտոարժույթի մեջ ներդրում անելը պետք է ուսումնասիր էլ
        այդ կրիպտոարժույթի Տոկենոմիկան
        հասկանալու համար տվյալ տոկենը ունի աճի հնարավորություն և արդյոք
        այն իրենից չի ներկայացնում խափեբայություն
      </b>
      <h3>Տոկենոմիկան կարող ենք գտնել</h3>
      <b>
        Նախագծի peachDesc ում whitePaper ում կամ lightPaper ում։
      </b>
      <ul>
        <li>WitePaper նախագծի տեխնիկական նկարագիրնա։</li>
        <li>LightPaper դա կրճատված տարբերակնա WhitePaper ի</li>
        <li>PeachDecn էլ պրեզենտացիանա որը ուղարկում են ներդրողներին</li>
        <b>
          Կան նախագծեր որոնց կայքում կա տոկենոմիկայի համար առանձնացված մաս
        </b>
      </ul>
      <h3>Տոկենոմիկան բաժանենք 2 մասի</h3>
      <b>
        1. Տոկները որոնք դեռ լիստինգ չեն եղել բորսաներում
      </b>
      <br />
      <b>
        2.  Տոկեները որոնք Լիստին եղել են արդեն և գտնվում են շրջանառությխն մեջ
      </b>
      <h3>Տոկենի բաշխումը տեղի է ունենում 2 եղանակով</h3>
      <p><b>1 արդար բաշխում - </b>
        երբ տոկենը մտնումա բորսա առանց ինչ որ ինվեստիցաների։ օրինակ մայնինգի օգնությամբ և ոչ ոքի հասանելի չէ այդ տոկեները մինչ այն լիստինգ չլինի
      </p>
      <p><b>2 անարդար բաշխում - </b>
        երբ տոկենի վաճառքը սկսվում է մինչ նրա լիստինգը ինչոր կրիպտոբորսա
      </p>
      <b>
        Նախագծերը հիմնականում ընտրում են 2 րդ
        տարբերակը (անարդար բաշխում)
        հենց այստեղ մեզ հարկավոր է մանրակրկիտ
        ուսումնասիրել տոկենոմիկան
      </b>
      <br />
      <b>Այս մեթոդը նաև անվանվում է Տոկենի նախնական վաճառք Presale</b>
      <h3>Տոկենի նախնական վաճառքի փուլերը մինչ լիստինգը:</h3>
      <b>Տոկենի նախնական վաճառքի փուլերը </b>
      <p>Տոկենի վաճառքի այս եղանակը կոչվում է Presale կամ Տոկենի նախնական վաճառք</p>
      <b> Գոյություն ունի Presale 3 հիմնական փուլ </b>
      <li>1. seed round</li>
      <li>2. private round</li>
      <li>3. public round</li>


      <h3>1. seed round</h3>
      <b>
        Seed էտապում լուծվում նախագծի նախնական ֆինանսավորման հարցը: Միջոցները ներդնում են Նախագիծը ստեղծողները, կամ վենչուրային ֆոնդերը , այս փուլում հավագված գումարները ուղղվումեն թիմ հավագելու և նախագիծը ռեալիզացնելու համար Seed էտապում Ինվեստիցիա անելը մեծ Ռիսկային է քանի որ Ինվեստիցին տևում է բավական երկար Բայց միևնույն ժամանակ ավելի շահեկան է քանի որ Տոկենի գինը ամեանցածրն է
      </b>
      <h3>2. Private (Pre-ICO) round</h3>
      <b>

        Private էտապում ներդրումներ անումեն հիմնականում Վենչուրային ֆոնդերը այս փուլի հիմնական նպատակը ներգրավել ավելի շատ ներդրողների: Այս Էտապում արդեն բոլոր հետաքրքրված մարդիկ կարողեն գնել Տոկենը: Այս փուլում ներդրում անելը ավելի շահեկան է քանի որ Նախագիծը որպես այդպիսին ունի արդեն բիզնես մոդելը և հնարավոր է նաև ծրագրի beta վերսիան
        Private էտապում հավագված գումարները ուղղվում են հիմնականում Նախագծի մարկեթինգը ապահովելու համար
      </b>
      <h3>3. Public round</h3>
      <b>
        Public էտապ ը համարվում է ամենամեծ ներդրումների էտապը Տոկենի լիստինգից առաջ: Այս փուլում վաճառքի դրվում են սահմանափակ քանակությամբ Տոկեներ և ներդրողների ավելի լայն շրջանակներում սկսվում է Տոկենի վաճառքը Այս փուլում արդեն ամողջանում ողջ ներդրողների բազան
      </b>
      <h3>Public էտապ ը իր հերդին բաժանվում է տարբեր խմբերի
        ICO IDO IEO
      </h3>
      <h3><h1>1</h1> ICO (Initial Coin Offering)
        Տոկենի նախնական առաջարկ</h3>

      <p>
        ICO (Initial Coin Offering) Տոկենի նախնական առաջարկ, այս մեխանիզմը համարվում է ամենահայտնի և էֆֆեկտիվ  մեթոդը Crowdfunding ի

        ICO tokenSale ի ձև է երբ տոկեների վաճառքը տեղի է ունենում հիմնադիրների միջոցով կամ ինչ որ հատուկ հարդակներում, այլ կերպ ասած սա տոկենի փոխանակումն է այլ կրիպտոարժութներով

        Որպեսզի թողարկեն ICO ն հիմնադիրներին չի պարտադրվում ներկայացնել իրենց անձնական տվյալները կամ կազմակերպության մասին հավելյալ ինֆորմացիա։
        Կարելի է ստեղծել սայթ գրել witepaper ը և թողարկել ծրագիրը ։
        Նման ոչ լիարժեք ներկայացումը հանգեցրեց նրան որ ICO ների մեծ մասը ստեղծվել է խափեբաների կողմից։

        ICO ի առավեթությունը նա է որ պետությունը չունի նրա հանդեպ ոչ մի լծակ։ ICO ի երաշխավորը կարող է հանդիսանալ միայն նրա թիմի անդամների հանդեպ վստահության ձևով

        Համաձայն հետազոտություների երբ նոր առաջացել էր այս տերմինը 2017 թվականին 70% ICO ները եղել են խաբեբայություն։

        81% ICO - խաբկանք
        6% - ձախոխվել է
        5% - մահացել է
        8% - միայն մուտք գործել բորսա

        Ամենահատնի և ապահով ICO հարթակը դա <a href="https://coinlist.co/" target="_blank">CoinList ն է</a>
      </p>
      <a href="http://icodrops.com" target='_blank'>icodrops</a>
      <br />
      <h3><h1>2</h1>IEO(Initial Exchange Offering) Տոկենի նախնականա առաջարկը Բորսաներում</h3>
      <p>
        IEO(Initial Exchange Offering) Տոկենի նախնականա առաջարկը Բորսաներում

        Սա tokenSale ի ձև է որտեղ տոկենի նախնական վաճառքով զբաղվում է Կրիպտոբորսան
        Կարելի է ասել IEO ն դա նույն ICO ն է ուղակի այտեղ ամենինչը վերահսկվում Կրիպտոբորսայի միջոցով
        Ի տարբերություն ICO Ի IEO ի ստարտափ թիմը չի թողարկում Տոկենը այլ հարդակներում միջոցներ հավագելու համար, այլ անցնում է ՖինանսաԻրավաբանական ստուգում բորսայի կողմից Due Diligence։ Որտեղ ստուգվումա նախագծի ողջ փաստաթղթերը, ստեղծվում է Իրավաբանական անձ, ստուգվում է Ֆինանասական իրավիճակը և էլի լիքը էտապներ։

        Երբ Ներդնողը մտնում է IEO ի tokenSale ին փոխանցում է իր գումարը ոչ թէ նախագծի սեփականատերերի դրամապանակին այլ բորսայի դրամապանակին։ Այս գումարները գտնվում են ամբողջովին բորսայի կառավարման տակ։

        Ամենահայտնի Binance ն է: Binance ի բոլոր tokenSlae րը տեղի է ունենում

        <a href="https://launchpad.binance.com/ru/viewall/lpd" target="_blank">Binance LaounchPad</a>
        Lounchpad հատվածում։ եթե ցանկանում եք մասնակց էլ tokenSlae էրին binance ում պետքէ ունենաք bnb տոկենը
      </p>

      <h3><h1>3</h1>IDO (Initail DEX Offering) - Տոկենի նախնական առաջարկը Ապակենտրոնացված բորսաներում։ </h3>

      <p>
        IDO (Initail DEX Offering) - Տոկենի նախնական առաջարկը Ապակենտրոնացված բորսաներում։

        Կարելի է ասել սա IEO ի և ICO միաձուլումն է։ IDO տերմինը բավականին նոր է։
        Այստեղ տոկենի վաճառքով զբաղվում է Նախագիծը բայց արդեն ապակենտրոնացված բորսաներում

        <b>ամենահայտնի հարթակները DaoMaker Polkastarter</b>
        <a href="https://daomaker.com/" target="_blank">DaoMaker</a>
        <br />
        <a href="https://polkastarter.com/" target="_blank">Polkastarter</a>
        <b>
          IDO (Initail DEX Offering) - Տոկենի նախնական առաջարկը Ապակենտրոնացված բորսաներում։
          Սա TokenSale ի ձև է երբ Տոկենի նախնական վաճառքը տեղի է ունենում Ապակենտրոնացված բորսաների միջոցով, օգտագործելով pool liquidity մեխանիզմը, որի օգնությամբ թրեյդերները կարող են հեշտությամբ և արագ ձեռք բերել նոր Տոկեները DEX երից։

          pool liquidity Ստաբիլ Քոինի և Կրիպտոարժույթի զույգով տեղի ունեցող առևտուրն է  օրինակ USDT/ETH։ այս մեխանիզմի շնորհիվ թրեյդերները կարող են Ստաբիլ Քոիներից անցնեն Կրիպտոարժույթների։

        </b>

        Հիմնականում այս հարթաակները աշխատում են ERC20 ով
      </p>
      <div>
        <h1>Տոկենոմիկա կետ առ կետ</h1>
        <ul>
          <li>* Տոկենի արժեքը տարբեր փուլերում (seed, private, public)</li>
          <li>* Հավաքագրված գումարի չափը IDO-ում</li>
          <li>* Տոկենի բաշխման գրաֆիկ և Vesting</li>
          <li>* MarketCup Նախագծի Կապիտալիզացիա</li>
          <li>* Էմմիսիա</li>
          <li>* Ինֆլյացիա և Դեֆլյացիա</li>
          <li>* Հոլդերներ</li>
        </ul>

        <div>
          <h2>1 Տոկենի արժեքը տարբեր փուլերում (seed, private, public)</h2>
          <b>
            seed ու public էտապների միջև գնային տարբերությունը չպետք է գերազանցի 5 % - ը:
            Եթե այս փուլերի տարբերությունը ավելին է քան 5% ը,
            հարկավոր է ուշադիր զննել seed էտապում վաճառված տոկեների vesting-ը
          </b>
          <h2>2 Հավաքագրված գումարի չափը IDO-ում</h2>
          <b>
            IDO-ում Հավաքագրված գումարի չափը պետք է լինի ոչ ավել քան 1մլն $:
            Այն ինչը ավել է 1մլն$ դա վատ ազդանշան է,
            ընդհանրապես իդալականը դա 700-900 հազար $ ն է
          </b>
          <h2>3.Տոկենի բաշխման գրաֆիկ և Vesting</h2>
          <b>
            Նախագիծը ստեղծողներին ընդհանուր Տոկեների քանակից պետքա
            բաժին հասնի ոչ ավել քան 15% ինպես նաև թիմի անդամերի
            Տոկեները նրանց պետքա հասանելի լինի նախագիծը լիստինգ
            լինելուց 1տարի հետո ամենաքիչը
            Public էտապում Տոկեները պետքա վաճառվեն,
            ընդհանուր Տոկեների քանակի ընդամենը 5%
            Ընդհանուր Քանակության 30%-ից ավելը պետքա
            ուղղված լինի Նախագծի զարգացման վրա
            Տոկեների բացթողման գրաֆիկը պեքա սահուն լինի,
            այլ ոչ միանգամից և մեծ քանակությամբ
            <li>team - 10-15%</li>
            <li>public round - 1-5%</li>
            <li>ecosystem, marketing - 30%</li>
          </b>
          <b>
            seed ու private էտապների vesting ը
             պետք է ավելի քիչ լինի քան publice էտապինը օրիննակ
              seed 16% օրիննակ private 16% օրիննակ public 35%
          </b>
          <h2>4. MarketCup Նախագծի Կապիտալիզացիա</h2>
          <b>
            Նախագծի Շուկայական Կապիտալիզացիան որը արդեն listing ա եղել որոշվումա շրջանառության մեջ գտնվող Տոկեների քանակը բազմապատկելով ներկայիս գնին
            <h2>circulation supply * price = MarketCup</h2>
            Նախագծերը որը դեռ listing չեն եղել որոշվումա հետևյալ կերպով
            Վերցնումենք Տոկեների ողջ քանակը(MaxSupply) և բազմապատկում ենք public էտապի գնին {'=>'} FDV (Fully Diluted Valuation)
            MaxSupply * publiceSalePrice = MarketCup
            Public էտապում Կապիտալիզացիան հաշվելու նպատակը նա է որ այդ նախագիծը որում ցանկանում եք ներդրում անել համեմատենք նմանատիպ այլ նախագծերի կապիտալզացիաի հետ որպիսզի հասկանանք մեր նախագիծը աճի հնարավորություն ունի թէ ոչ
            Կապիտալիզացիան տեսնելու համարcoinmarketcup
            coingeko
          </b>
          <h4>ինչպես համեմատել listing չեղած Տոկենի Կապիտալիզացիան և listing եղած Տոկենի Կապիտալիզացիան</h4>
          <p>
            Օրինակ համեմատվող տոկենի ցիրկուլացիան 18մլն է իսկ մեր տոկենի ընդհանուր քանակը 100մլն 5 անգամ ավելի շատ քան համեմատվող տոկենի քանակը
            համեմատվողի Կապիտալիզացիան 4մլրդ իսկ մերը 25մլն
            Օրինակ եթե մեր տոկենի քանակը 5 անգամ ավելա մեր տոկենի նախանական Կապիտալիզացիան բազմապատկենք 5 ով
            25mln * 5 = 1milyard
            25mln և 1mlrd տարբերությունը 40 անգամ է այսինքն մեր տոկենի գինը 40 անգամ պետքա աճի IDO գնի հանդեպ
            Օրինակ եթե Տոկենի -ը մլն, իսկ նրա արժեքը էտապում 4, Տոկեների ամբողջ շրջանառության դեպքում նախագծի Կապիտալիզացիան կկազմի մլն Մինչև լիստինգ լինելի Տոկենի Կապիտալիզացիան չպետք է գերազանցի մլն
          </p>
          <h2>5. Էմմիսիա</h2>
          <b>
            1.Տոկեների քանակը (maxSupply)պետք է լինի սահմանափակ
            2.(initial token circulation) Տոկեների նախնական թողարկման ժամանակ լավ նշան է երբ Տոկեների քանակը (maxSupply) ի 50% ից ավելը թողարկվում է իսկ մնացյալ մասը կթողարվի 4 տարուց ոչ պակաս ժամանակահատվածում և ոչ միանգամից այլ էտապներով BitCoin ի Օրինակը բերել
            Այս ամենի մասին ինֆոն նախագծի տերը պետքա ցույց տա
            Այս ամենի մասին ինֆոն կարողենք տեսնել coinmarketcup.com կայքում
            բայց եթե ցուցադրված չի coinmarketcup.com ում maxSupply տեսնելու համար կարողենք նաև շրջանառվող տոկեների քանակը բաժանել ընդհանուր տոկեների թվին
            circulationSupply / MaxSupply = Էմիսիայի հարաբերակցությունը % ովօրինակ BTC 19mln/21mln = 90%



            Մեզ հարկավոր Է Շրջանառվող տոկեները  Բաժանել Ընդհանուր Առաջարկի վրա այսինքն

            Circulation Supply / Max Supplay վրա
            Կստանանք Տոկոսային հարաբերակցությունը թե ապագայում ինչքան % տոկեն կլցվի շուկա Ինչքան % ավելի բարձր է ենքան մեր համար լավ Օրինակ եթե % ին հարաբերակցությունը կազմում է 4-5 % ապա ապագայում 95 % կլցվի շուկա նպաստելով գնի անկմանը ։
            Էմմիսիայի նորմալ քանակը 45 ից 50 %
          </b>
          <h2>Ինֆլյացիա և Դեֆլյացիա</h2>
          <b>
            Տոկեները լինում են Ինֆլյացիոն և Դեֆլյացիոն
            Ինֆլյացիա
            Տոկեները համարվում են Ինֆլյացիոն երբ maxSupply սահմանափակված չի և ժամանակի ընթացքում նրանց քանակը շուկայում ավելանում է հանգեցնելով գնի անկմանը
            Դեֆլյացիա
            Տոկեները համարվում են Դեֆլյացիոն երբ maxSupply սահմանափակված էԲացի սա կա նաև Տոկենի վառելու պռոցես, գոյություն ունեն տոկեներ որոնք կարողանում են վառել վառել որոշակի քանակությամ տոկեները այսպիսով ապահովել տոկենի ԴեֆլիացիանՕրինակ bnb ին որը եռամսյակը մեկ վառում է Binnace մաքուր եկամուտի 20% չափով
            Եթե նախագծի writePaper - ում գրվածա որ տոկենի maxSupply ը սահմանափակա ինչպես նաև տոկեն ը ունի Դիֆլացիոն մեխանիզմ Դա լավ նշանա
          </b>
          <h2>Հոլդերներ (Տոկենի Սեփականատերերը)</h2>
          <b>
            Երբ նախագիծը արդեն listing ա եղել որև Բորսայում կարողենք գտնել այդ Տոկենի սեփականատերերին(holders)
            նախ հասկանանք թե որ Բլոչեյնի վրայա նախագիծը
            Etehrum etherscan <a href="https://etherscan.io/" target="_blank" rel="noopener noreferrer"></a>
            Binance bscscan <a href="https://bscscan.com/" target="_blank">bscscan</a>
            մտնումենք այս կայքերը որպիսի պարզենք որ Դրամապանակներից ոչ մեկի վրա չկա մեծ քանակի Տոկեներ Նորմը համարվումա 5-7 % ոչ ավել մի դրամապանակի վրա
            Icon ov da smartContracta noIcon da bumajnika
          </b>
        </div>
      </div>
    </div>
  )
}


//https://merehead.com/ru/blog/ido-offering-future-trends/

// ICO (Initial Coin Offering)
//       Տոկենի նախնական առաջարկ ICO ում ներառում է այն ամենը ինչը կապված է Public էտապի հետ ICO էտապում տեղի է ունենում նախագծի ֆինանսավորումը Տոկենը ստեծղելուն զուգընթաց Manramasnel
//       ICO-ի ժամանակ Տոկենը վաճառում են կազմակերպիչները իրենց հարթակներում
//       IEO (Initial Exchange Offering)
//       Տոկենի նախնական առաջարկ IEO ում վաճառքը տեղի է ունենում կենտրոնացված Բորսաներում օրինակ Binance և վաճառքը վերահսկվում է Բորսաի կողմից
//       IDO (Initial DEX Offering)
//       Տոկենի նախնական առաջարկը ապակենտրոնացված Բորսաներում ժամանակ վաճառճը տեղի է ունենում Տոկենը ստեղծողների և Բորսաի վերահսկողությամբ:
//       IDO-ն համարվում է ICO և IEO միաձուլումը այսպես ասած

// // Շուկայական կապիտալիզացիա 
// և FDV (Fully Diluted Valuation)


// Շուկայական կապիտալիզացիա - 
// Տոկեների շրջանառվող քանակը * Տոկենի արժեքը 

// FDV - ներկա արժեքը * մաքսիմալ առաջարկի վրա

// —— 
// Տոկենի արժեքը 10$ 
// Circulation Supplay 10 000 000
// Maxsimum Supplay 100 000 000 

// Շուկայական կապիտալիզացիա - 
// 10մլն * 10 = 100 000 000 
// FDV - 100 մլն * 10 = 1 մլրդ 

// Այս երկու պահերը մեզ պետքա հաշվելու համար տոկենի աճի հնարավորությունը 
// Սրանք մեզ տալիսեն սոգնալ թե շուկան իչպես է գնահատում նախագիծը այսօր և նախագիծը ինչպես պետք է աճի որ արդարացնի իր այսօրվա գինը 
// Եթե տարբերությունը այս երկուսի շատ մեծ է դա նշանակում է որ նախագիծը ունի դեռ չթողարկած շատ տոկեներ որոնք պետք է դուրս գան շուկա
export default Tocenomics