import React from 'react'

const Terminalogia = () => {
  return (
    <div>
      <h2>Տերմինալոգիա</h2>
      <div>
        <h3>Ի՞նչ է կրիպտոարժույթը:</h3>
        <b>Կրիպտոարժույթը թվային ակտիվ է և միևնույն ժամանակ վճարային համակարգ, որն օգտագործում է կրիպտոգրաֆիկ ֆունկցիա՝ գրառումները ծածկագրելու համար: Կրիպտոարժույթները հիմնված են բաշխված մատյան տեխնոլոգիայի՝ բլոկչեյնի վրա: Կրիպտոարժույթը համարվում է ֆիատ փողի այլընտրանք, որը թողարկվում է կառավարության կողմից:</b>
      </div>
      <div>
        <h3>Ի՞նչ է Տոկենը</h3>
        <b>
          Տոկենը -
          Թոքենը թվային ակտիվ է, որը կապված է կոնկրետ նախագծի հետ և թողարկվում է կրիպտոարժույթի հիման վրա: Օրինակ, Ethereum բլոկչեյն պլատֆորմի հիման վրա դուք կարող եք ստեղծել ERC20 ստանդարտի նշաններ, ներառյալ հայտնի stablecoin USDT-ը:
        </b>
      </div>
      <div>
        <h3>Ի՞նչ է stablecoin ը</h3>
        <b>
          Stablecoin-ը ֆիքսված փոխարժեքով նշան է: Ամենից հաճախ նման մետաղադրամների գնանշումները կապված են դոլարի հետ։ Կան այլ տարբերակներ. Օրինակ, Tether ընկերությունը թողարկեց կայուն XAUT-ը, որն արժե այնքան, որքան մեկ տրոյական ունցիա ոսկի:

          Պարզ ասած, 1USD-ը 1USDT է (Ամեն ինչ շատ պարզ է):
        </b>
      </div>
      <h2>Եկեք վերադառնանք նշանին: Ո՞րն է կրիպտոարժույթի բորսայի հիմնական նշանի անունը: - Ճիշտ է, Bitcoin (BTC):</h2>

      <b>
      Բիթքոյնն առաջին կրիպտոարժույթն է։ Ten Years-ը ազատ է արձակվել 2009 թվականին Սատոշի Նակամոտո կեղծանունով թաքնված անձի (կամ մարդկանց խմբի) կողմից։ Այս պահին բիթքոյնը կրիպտո շուկայի առաջատարն է՝ 40-60% մասնաբաժնով (ցուցանիշները փոխվում են, բայց այն հետ չի գնում և հավաքում է)։
      </b>
      <h2>Լավ, այս կետը հստակեցված է։ Եկեք մտնենք այս գազանի գլխարկի տակ:</h2>
      <b>
      Բլոկը - կրիպտոարժույթի ցանցում կատարված գործարքների ցանկն է, որոնք մշակվել և հաստատվել են հանքագործների կողմից: Բլոկները ստեղծվում են յուրաքանչյուր որոշակի ժամանակահատվածում մեկ անգամ, ինչը տարբերվում է կրիպտոարժույթների մեծ մասի համար: Օրինակ, Bitcoin բլոկչեյնում բլոկ է ստեղծվում 10 րոպեն մեկ անգամ: Բլոկը ձևավորվելուց հետո ավելացվում է շղթայով միացված նախկինում հայտնաբերված բլոկներին։ Այսպես է ձևավորվում բլոկչեյնը։
      </b>
      <br/>
      <b>
      Բլոկչեյնը - (անգլերենից՝ բլոկների շղթա) բաշխված ռեեստր է, որը բաղկացած է բլոկների շղթայից, որոնցից յուրաքանչյուրում գրանցվում են գործարքները։ Յուրաքանչյուր հաջորդ բլոկ միացված է նախորդին: Այս հաջորդականությունը չի կարող խախտվել կամ փոփոխվել, հակառակ դեպքում կրիպտոարժույթի ցանցի տվյալները կդառնան անվավեր:
      </b>
      <h2>Դրամապանակ</h2>
      <b>
      Դրամապանակը - կրիպտոարժույթի պահպանման ծրագիր է: Այն թույլ է տալիս օգտվողներին մուտք գործել թվային ակտիվներ, դրանք փոխանցել այլ հասցեներով, օգտագործել դրանք վճարումների և այլ նպատակներով:
      </b>
      <br />
      <b>
      Դրամապանակների մի քանի տեսակներ կան. Սառը կամ ապարատային դրամապանակները առանձին սարքի տեսքով են՝ նման է ֆլեշ կրիչին։ Դրանք համարվում են ամենաանվտանգը, քանի որ կրիպտոարժույթը կարող եք օգտագործել միայն դրամապանակին ուղղակի մուտքով և դրա գաղտնաբառը իմանալով:
      </b>
      <li>Բրաուզերի դրամապանակները դրամապանակներ են, որոնք ներկառուցված են դիտարկիչում որպես ընդլայնում:</li>
      <li>Սեղանի դրամապանակները հատուկ հավելվածներ են, որոնք տեղադրված են համակարգչում:</li>
      <li>Փոխանակման դրամապանակները դրամապանակներ են, որոնք օգտվողները ստանում են կրիպտոարժույթի առևտրի համար բորսաներում հաշիվներ բացելիս: Ֆոնդերի պահպանման այս մեթոդը համարվում է ամենավտանգավորը:</li>
    </div>
  )
}

export default Terminalogia