import React from 'react'

const Vesting = () => {
    return (
        <div>
            Ինչ է Վեստինգը։

            Ինչպես գիտենք Բլոկչեյն աշխարհում նոր նախագծերը ստեղծում են իրենց տոկեները և վաճառում են այն մինչ տոկենի լիստինգ լինելը ինչ որ կրիպտոբորսա։ Սա կոչվում է տոկենի նախնական վաճառք։
            Որը տեղի է ունենում հիմնականում 3 էտապով -
            1 seed էտապ - հիմնականում վենչուրային ֆոնդեր
            2 private էտապ - ավելի քիչ վենչուրային ֆոնդեր հիմնականում մարկետինգով զբաղվողներին
            3 pabic էտապ - արդեն բոլոր մարդկանց ովքեր հետաքրքրված են նախագծով
            Այս ամենը տեղի է ունենում DEX է րում«Ապակենտրոնացված բորսաներում»։ և այն կոչվում է IDO:
            Տոկենի լիստինգ լինելբւց հետո ինչ որ բորսա բոլոր նրանք ովքեր գնելեն տոկենը կստանան այն այն գնով որով գնել են այդ էտապում։ Այսինքն seed private և public էտապներում ձեռք բերված տոկենի գները կլինեն տարբեր և բնականաբար լիստինգից հետո եթե  բոլոր տոկեները հասանելի լինեն իրենց սեփականատերերին նրանք բոլորը կսկսեն վաճառել այն որը կհանգեցնի տոկենի գնի նվազմանը։
            Եվ այստեղ ծնվումա մի գաղափար որը կոչվում է Վեստինգ։
            ——
            Վեստինգը դա Տոկեների ապասառեցման և բաշխման գործընթացն նշված ժամանակահատվածում ։
            Կոնկրետ ժամանակահատվածը որտեղ տեղի է ունենում տոկեների բաշխումը կոչվում Վեստինգի ժամանակահատված։

            Cliff - այն ժամանակահտվածը երբ տոկեները սառեցված են, որոշ ժամանակ մինչև Վեստիգի ժամանակահատված։
            Cliff ը հիմնականում օգտագործվում seed և private էտապների համար։

            Վեստինգի տեսակները։
            1։ linear(Գծային ) vesting
            2։twised (Ոլորված) vesting

            Linear Vesting - սա Վեստինգի ձև է երբ տոկեների բաշխումը տեղի է ունենում հավասար մասերով տրված ժամանակահատվածներում, որը կարող է տևել մի քանի օրից մինչև ՄԻ քանի տարի։
            Twisted Vesting - սա Վեստինգի ձև է երբ տոկեների բաշխումը տեղի է ունենում պատահական մասերով տարբեր ժամանակահատվածներում, օր տարի մինչև

            Օրինակներ
            Linear Vesting -
            600.000 տոկեն։ Գծային վեստինգի ժամանակ 50.000 տոկենը կտրվի սեփականատերներին ամեն ամիս։ որը թույլ կտա ավարտել բաշխումը մեկ տարուց։ Եթե նաև ավելացնենք 6 ամիս Cliff ը։ ապա Սեփականատերերը կստանան իրենց տոկեները 50 000 ամեն ամիս,  1 տարվա կտրվածքով, Սկսված 6 րդ ամսից։

            Twisted Vesting - 25%ը 600.000 տոկենի կարող է բաշխվել ամեն ամիս մինչև 3 րդ ամիսը։ որից հետո 75% տոկեների կարող են բաշխվել 6 ամիս Cliff ից հետո։
        </div>
    )
}

export default Vesting